export default {
  regTypeMap: [
    /单间/g,
    /(1|一)室(1|一)厅/g, 
    /(2|二|两)室(1|一)厅/g, 
    /(2|二|两)室(2|二|两)厅/g, 
    /(3|三)室(1|一)厅/g, 
    /(3|三)室(2|二|两)厅/g, 
    /^((?!单间|((3|三|2|二|两|1|一)室(2|二|两|1|一)厅)).)*$/g
  ],
  contentFilterMap: [
		/\s/g,
		/1\d{10}/g,
		/☎联系时请告知是在江安【聚E起】万人便民服务平台看到的信息。/g
  ],
  regTypeTextList: ['全部','单间','一室一厅','二室一厅','二室二厅','三室一厅','三室二厅','其他'],
  classTypeTextList: ['全部','租房','售房','租门市','售门市','求租'],
  regTypeTextListNoAll: ['单间','一室一厅','二室一厅','二室二厅','三室一厅','三室二厅','其他'],
  classTypeTextListNoAll: ['租房','售房','租门市','售门市','求租'],
}